/****************************************************************************
* ルネサスC初期設定ルーチンの例 (SH)                                        *
*                                                                           *
*  File name : initsh.c                                                     *
*                                                                           *
* 24/May/1997 作成                                                          *
* 06/Dec/1999 -fpu=doubleオプションに対応                             MiSPO *
* 24/Mar/2006 mainの型を関数定義に合わせてvoidからintに修正              EM *
* 25/Jul/2008 コメントを追記                                             KZ *
****************************************************************************/

#include "machine.h"

extern int *_D_ROM, *_D_BGN, *_D_END, *_B_BGN, *_B_END;
extern void _INITSCT(void);
extern int main(void);
#pragma noregsave(_INIT)

/*****************************************************************************
* 初期設定
*
******************************************************************************/

void _INIT(void)
{
    _INITSCT();     /* セクションの初期化ルーチンの呼び出し */
#ifdef _FPD
    set_fpscr(((int)get_fpscr()&~0x00100000)|0x00080000);
#endif
    main();         /* メインルーチンの呼び出し */
    for (;;)        /* 万一、main 関数終了したら、無限ループ */
        ;
}

/*****************************************************************************
* セクションの初期化
*
******************************************************************************/

void _INITSCT(void)
{
    int *p, *q;

    /* 未初期化データ領域をゼロで初期化 */

    for (p = _B_BGN; p < _B_END; p++)
        *p = 0;

    /* 初期化データを ROM 上から RAM 上へコピー */

    for (p = _D_BGN, q = _D_ROM; p < _D_END; p++, q++)
        *p = *q;
}

/* end */
