/******************************************************************************
* 入出力監視タスク                                                            *
*                                                                             *
* File name : tskio.h                                                         *
*                                                                             *
* Copyright (c) 2018 NICHIRYO Co., Ltd.                                       *
*                                                                             *
******************************************************************************/
#ifndef _TSKIO_H_
#define _TSKIO_H_



/*************************************
 関数定義
 *************************************/
extern TASK	TskIo( void );													// ＩＯ監視
extern UINT	GetCount(UB ch);												// カウント数取得

#endif  // _TSKIO_H_
