/******************************************************************************
* ＰＣ通信送信タスク(SIO0)ヘッダ                                              *
*                                                                             *
* File name : tsktx0.h                                                        *
*                                                                             *
* Copyright (c) 2018 NICHIRYO Co., Ltd.                                       *
*                                                                             *
******************************************************************************/
#ifndef _TSKTX0_H_
#define _TSKTX0_H_


// タスク
extern TASK TskTx0( void );


#endif // _TSKTX0_H_
