/******************************************************************************
* シリアル通信2 送信タスクヘッダ                                              *
*                                                                             *
* File name : tsktx2.h                                                        *
*                                                                             *
* Copyright (c) 2018 NICHIRYO Co., Ltd.                                       *
*                                                                             *
******************************************************************************/
#ifndef _TSKTX2_H_
#define _TSKTX2_H_


// タスク
extern TASK TskTxEx( void );


#endif // _TSKTX2_H_
